UB_Copy/src/InformationRegisters/УБ_СхемыСбораДанныхПоказателейЭффективности/УБ_СхемыСбораДанныхПоказателейЭффективности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_СхемыСбораДанныхПоказателейЭффективности</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СхемаКомпоновкиДанныхПлана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ХранилищеСхемыКомпоновкиДанныхПлана</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеНастроекКомпоновкиДанныхПлана</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СхемаКомпоновкиДанныхФакта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ХранилищеСхемыКомпоновкиДанныхФакта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеНастроекКомпоновкиДанныхФакта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеУстановкиПлана</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеПодсчетаФакта</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеИнструментовДляАнализа</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВариантРасчетаЗначенияПлана</name>
    <type>
      <types>EnumRef.УБ_ВариантыРасчетаЗначенийПоказателя</types>
    </type>
  </resources>
  <resources>
    <name>ВариантРасчетаЗначенияФакта</name>
    <type>
      <types>EnumRef.УБ_ВариантыРасчетаЗначенийПоказателя</types>
    </type>
  </resources>
  <resources>
    <name>ПериодСбораДанных</name>
    <type>
      <types>EnumRef.УБ_ПериодыРасчетаСбораДанных</types>
    </type>
  </resources>
  <dimensions>
    <name>ПоказательЭффективности</name>
    <type>
      <types>CatalogRef.УБ_ПоказателиЭффективности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/Enums/УБ_ВариантыРасчетаЗначенийПоказателя/УБ_ВариантыРасчетаЗначенийПоказателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УБ_ВариантыРасчетаЗначенийПоказателя</name>
  <enumValues>
    <name>Вручную</name>
  </enumValues>
  <enumValues>
    <name>ИзМодели</name>
  </enumValues>
  <enumValues>
    <name>ИзСхемыПоказателя</name>
  </enumValues>
  <enumValues>
    <name>ИзДокументаПланирования</name>
  </enumValues>
  <enumValues>
    <name>ИзДокументаУстановкиФакта</name>
  </enumValues>
</mdclass:Enum>

UB_Copy/src/Catalogs/УБ_ПоказателиЭффективности/УБ_ПоказателиЭффективности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УБ_ПоказателиЭффективности</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВариантРасчетаЗначенияПлана</name>
    <type>
      <types>EnumRef.УБ_ВариантыРасчетаЗначенийПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаЗначенияФакта</name>
    <type>
      <types>EnumRef.УБ_ВариантыРасчетаЗначенийПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасценки</name>
    <type>
      <types>EnumRef.УБ_ВидыРасценокПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УБ_ЕдиницыИзмеренияПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндикаторЦелевогоПоказателя</name>
    <type>
      <types>EnumRef.УБ_ИндикаторЦелевогоПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьНастройкуИзТипаПоказателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьФормулу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеЗначениеРезультата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеЗначениеРезультата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НегативноеОтклонениеНормыДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьВРасчетеПерсональнойЭффективности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнениеКомментария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьМаксимальноеЗначениеРезультата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьМинимальноеЗначениеРезультата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИнструментовДляАнализа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПодсчетаФакта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеУстановкиПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьРасчета</name>
    <type>
      <types>EnumRef.УБ_ПериодичностьРасчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерспективаССП</name>
    <type>
      <types>CatalogRef.УБ_ПерспективыССП</types>
    </type>
  </attributes>
  <attributes>
    <name>ПограничноеОтклонениеНормыДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПограничноеОтклонениеНормыОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодсказкаПоЗаполнениюКомментария</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПозитивноеОтклонениеНормыОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательРасчетаЗарплаты</name>
    <type>
      <types>DefinedType.УБ_ПоказателиРасчетаЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьПринадлежитПодразделению</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринадлежностьПоказателя</name>
    <type>
      <types>DefinedType.УБ_НазначенияПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьРезультатОтФакта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПоказателя</name>
    <type>
      <types>EnumRef.УБ_СостоянияПоказателейЭффективности</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначенияПоказателя</name>
    <comment>число/булево/строка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>CatalogRef.УБ_ТипыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасчета</name>
    <type>
      <types>EnumRef.УБ_ТипыРасчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Фиксированный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаПоказателей</name>
    <type>
      <types>CatalogRef.УБ_ШкалыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>УчаствуютНижестоящиеПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПринадлежности</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчетаСбораДанных</name>
    <type>
      <types>EnumRef.УБ_ПериодыРасчетаСбораДанных</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПериодыИспользованияПоказателя</name>
    <attributes>
      <name>МесяцПрименения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВлияющиеПоказатели</name>
    <attributes>
      <name>ВлияющийПоказатель</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрекратилДействиеС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗависимыеПоказатели</name>
    <attributes>
      <name>ЗависимыйПоказатель</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрекратилДействиеС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрекратилДействиеЧекбокс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормулыРасчета</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UB_Copy/src/InformationRegisters/УБ_СхемыСбораДанныхПоказателейЭффективности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция АдресаСхемыКомпоновкиДанныхИНастроекВоВременномХранилище(Запись) Экспорт
	
	Адреса = Новый Структура;
	Адреса.Вставить("СхемаКомпоновкиДанныхПлана");
	Адреса.Вставить("НастройкиКомпоновкиДанныхПлана");
	Адреса.Вставить("СхемаКомпоновкиДанныхФакта");
	Адреса.Вставить("НастройкиКомпоновкиДанныхФакта");
	
	Если ТипЗнч(Запись) = Тип("ДанныеФормыСтруктура") Тогда
		МенеджерЗаписи = РегистрыСведений.УБ_СхемыСбораДанныхПоказателейЭффективности.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись.ИсходныйКлючЗаписи);
		МенеджерЗаписи.Прочитать();
	Иначе
		МенеджерЗаписи = Запись;
	КонецЕсли;
	
	СхемаКомпоновкиДанныхПлана = МенеджерЗаписи.ХранилищеСхемыКомпоновкиДанныхПлана.Получить();
	Если СхемаКомпоновкиДанныхПлана = Неопределено И ПустаяСтрока(МенеджерЗаписи.СхемаКомпоновкиДанныхПлана) Тогда
		СхемаКомпоновкиДанныхПлана = Справочники.УБ_ПоказателиЭффективности.ПолучитьМакет("ШаблоннаяСхемаКомпоновкиДанных");
	ИначеЕсли СхемаКомпоновкиДанныхПлана = Неопределено
		И Не ПустаяСтрока(МенеджерЗаписи.СхемаКомпоновкиДанныхПлана) Тогда
		СхемаКомпоновкиДанныхПлана = Справочники.УБ_ПоказателиЭффективности.ПолучитьМакет(МенеджерЗаписи.СхемаКомпоновкиДанныхПлана);
	КонецЕсли;
	
	Адреса.СхемаКомпоновкиДанныхПлана = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанныхПлана, Новый УникальныйИдентификатор);
	
	СхемаКомпоновкиДанныхФакта = МенеджерЗаписи.ХранилищеСхемыКомпоновкиДанныхФакта.Получить();
	Если СхемаКомпоновкиДанныхФакта = Неопределено И ПустаяСтрока(МенеджерЗаписи.СхемаКомпоновкиДанныхФакта) Тогда
		СхемаКомпоновкиДанныхФакта = Справочники.УБ_ПоказателиЭффективности.ПолучитьМакет("ШаблоннаяСхемаКомпоновкиДанных");
	ИначеЕсли СхемаКомпоновкиДанныхФакта = Неопределено
		И Не ПустаяСтрока(МенеджерЗаписи.СхемаКомпоновкиДанныхФакта) Тогда
		СхемаКомпоновкиДанныхФакта = Справочники.УБ_ПоказателиЭффективности.ПолучитьМакет(МенеджерЗаписи.СхемаКомпоновкиДанныхФакта);
	КонецЕсли;
	
	Адреса.СхемаКомпоновкиДанныхФакта = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанныхФакта, Новый УникальныйИдентификатор);
	
	НастройкиКомпоновкиДанныхПлана = МенеджерЗаписи.ХранилищеНастроекКомпоновкиДанныхПлана.Получить();
	Если ЗначениеЗаполнено(НастройкиКомпоновкиДанныхПлана) Тогда
		Адреса.НастройкиКомпоновкиДанныхПлана = ПоместитьВоВременноеХранилище(НастройкиКомпоновкиДанныхПлана, Новый УникальныйИдентификатор);
	КонецЕсли;
	
	НастройкиКомпоновкиДанныхФакта = МенеджерЗаписи.ХранилищеНастроекКомпоновкиДанныхФакта.Получить();
	Если ЗначениеЗаполнено(НастройкиКомпоновкиДанныхФакта) Тогда
		Адреса.НастройкиКомпоновкиДанныхФакта = ПоместитьВоВременноеХранилище(НастройкиКомпоновкиДанныхФакта, Новый УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат Адреса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыСведений.УБ_СхемыСбораДанныхПоказателейЭффективности.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "1.0.1.7";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение регистра ""Сбор данных показателей""'");
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказателиЭффективности.Ссылка КАК Ссылка,
		|	ПоказателиЭффективности.СхемаКомпоновкиДанных КАК СхемаКомпоновкиДанных,
		|	ПоказателиЭффективности.ХранилищеСхемыКомпоновкиДанных КАК ХранилищеСхемыКомпоновкиДанных,
		|	ПоказателиЭффективности.ОписаниеУстановкиПлана КАК ОписаниеУстановкиПлана,
		|	ПоказателиЭффективности.ОписаниеПодсчетаФакта КАК ОписаниеПодсчетаФакта
		|ИЗ
		|	Справочник.УБ_ПоказателиЭффективности КАК ПоказателиЭффективности
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УБ_СхемыСбораДанныхПоказателейЭффективности КАК СборДанных
		|		ПО ПоказателиЭффективности.Ссылка = СборДанных.ПоказательЭффективности
		|ГДЕ
		|	ПоказателиЭффективности.ВариантРасчетаЗначенияФакта = ЗНАЧЕНИЕ(Перечисление.УБ_ВариантыРасчетаЗначенийПоказателя.ИзСхемыПоказателя)
		|	И СборДанных.СхемаКомпоновкиДанныхФакта ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УБ_СхемыСбораДанныхПоказателейЭффективности");
			ЭлементБлокировки.УстановитьЗначение("ПоказательЭффективности", Выборка.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.УБ_СхемыСбораДанныхПоказателейЭффективности.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПоказательЭффективности.Установить(Выборка.Ссылка);
			
			Запись = НаборЗаписей.Добавить();
			Запись.Период = '20000101';
			Запись.ПоказательЭффективности = Выборка.Ссылка;
			Запись.СхемаКомпоновкиДанныхФакта = Выборка.СхемаКомпоновкиДанных;
			
			СхемаКомпоновкиДанныхФакта = Выборка.ХранилищеСхемыКомпоновкиДанных.Получить();
			Если СхемаКомпоновкиДанныхФакта <> Неопределено Тогда
				Запись.ХранилищеСхемыКомпоновкиДанныхФакта = Новый ХранилищеЗначения(СхемаКомпоновкиДанныхФакта);
			Иначе
				Запись.ХранилищеСхемыКомпоновкиДанныхФакта = Новый ХранилищеЗначения(Неопределено);
			КонецЕсли;
			
			Запись.ОписаниеУстановкиПлана = Выборка.ОписаниеУстановкиПлана;
			Запись.ОписаниеПодсчетаФакта = Выборка.ОписаниеПодсчетаФакта;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать справочник: %1 по причине: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстСообщения,
				Выборка.Ссылка,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление информационной базы'"),
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.РегистрыСведений.УБ_СхемыСбораДанныхПоказателейЭффективности,
				Выборка.Ссылка,
				ТекстСообщения);
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
